In [1]:
import sqlalchemy as db
from sqlalchemy import text
import pandas as pd

In [2]:
# conectarnos a base de datod retail_db

engine = db.create_engine("mysql://root:root@172.16.5.4:3310/retail_db")

In [3]:

from sqlalchemy import create_engine
engine = db.create_engine('mysql://root:root@172.16.5.4:3310/retail_db')

In [4]:
engine_clients = db.create_engine("mysql://root:root@172.16.5.4:3310/retail_db")

In [5]:
conn = engine.connect()

In [6]:
customers_df = pd.read_sql("SELECT * FROM customers",con=conn)
customers_df.head()

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,00725
3,4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,00725

In [7]:
order_df = pd.read_sql("SELECT * FROM orders",con=conn)
order_df.head()

   order_id order_date  order_customer_id     order_status
0         1 2013-07-25              11599           CLOSED
1         2 2013-07-25                256  PENDING_PAYMENT
2         3 2013-07-25              12111         COMPLETE
3         4 2013-07-25               8827           CLOSED
4         5 2013-07-25              11318         COMPLETE

In [8]:
order_items_df = pd.read_sql("SELECT * FROM order_items",con=conn)
order_items_df.head()

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99

In [9]:
products_df = pd.read_sql("SELECT * FROM products",con=conn)
products_df.head()

,product_id,product_category_id,product_name,product_description,product_price,product_image
0,1,2,Quest Q64 10 FT. x 10 FT. Slant Leg Instant U,,59.98,http://images.acmesports.sports/Quest+Q64+10+F...
1,2,2,Under Armour Men's Highlight MC Football Clea,,129.99,http://images.acmesports.sports/Under+Armour+M...
2,3,2,Under Armour Men's Renegade D Mid Football Cl,,89.99,http://images.acmesports.sports/Under+Armour+M...
3,4,2,Under Armour Men's Renegade D Mid Football Cl,,89.99,http://images.acmesports.sports/Under+Armour+M...
4,5,2,Riddell Youth Revolution Speed Custom Footbal,,199.99,http://images.acmesports.sports/Riddell+Youth+...

In [10]:
categories_df = pd.read_sql("SELECT * FROM categories",con=conn)
categories_df.head()

   category_id  category_department_id        category_name
0            1                       2             Football
1            2                       2               Soccer
2            3                       2  Baseball & Softball
3            4                       2           Basketball
4            5                       2             Lacrosse

In [11]:
departments_df = pd.read_sql("SELECT * FROM departments",con=conn)
departments_df.head()

   department_id department_name
0              2         Fitness
1              3        Footwear
2              4         Apparel
3              5            Golf
4              6        Outdoors

In [12]:
# calcular promedio de ingresos por dias

df_promedio = order_df.merge(order_items_df, left_on='order_id',right_on ='order_item_order_id',how='left')
df_promedio.head()

,order_id,order_date,order_customer_id,order_status,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,2013-07-25,11599,CLOSED,1.0,1.0,957.0,1.0,299.98,299.98
1,2,2013-07-25,256,PENDING_PAYMENT,2.0,2.0,1073.0,1.0,199.99,199.99
2,2,2013-07-25,256,PENDING_PAYMENT,3.0,2.0,502.0,5.0,250.00,50.00
3,2,2013-07-25,256,PENDING_PAYMENT,4.0,2.0,403.0,1.0,129.99,129.99
4,3,2013-07-25,12111,COMPLETE,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
df_promedio_final = df_promedio[['order_date','order_item_subtotal']].groupby('order_date').mean()['order_item_subtotal']
df_promedio_final

order_date
2013-07-25    201.043746
2013-07-26    196.714942
2013-07-27    200.943022
2013-07-28    198.911142
2013-07-29    206.136772
                 ...
2014-07-20    198.735674
2014-07-21    200.833781
2014-07-22    205.433596
2014-07-23    212.537150
2014-07-24    196.113818
Name: order_item_subtotal, Length: 364, dtype: float64

In [14]:
df_promedio_final = df_promedio[['order_date','order_item_subtotal']].groupby('order_date').sum()['order_item_subtotal']
df_promedio_final

# se cambio sum para mean para saber el promedio pero esto no nos ayuda
#por que solo nos da por la cantidad de ordenes 
# se usaria por el detal, y nosotros necesitamos por la orden

order_date
2013-07-25     68153.83
2013-07-26    136520.17
2013-07-27    101074.34
2013-07-28     87123.08
2013-07-29    137287.09
                ...
2014-07-20    141499.80
2014-07-21    121102.77
2014-07-22     73134.36
2014-07-23     87990.38
2014-07-24     97076.34
Name: order_item_subtotal, Length: 364, dtype: float64

In [15]:
df_promedio_final = df_promedio[['order_date','order_item_subtotal']].groupby('order_date').sum()['order_item_subtotal']/df_promedio[['order_date','order_item_order_id']].drop_duplicates().groupby('order_date').count()['order_item_order_id']
df_promedio_final

order_date
2013-07-25    587.533017
2013-07-26    585.923476
2013-07-27    577.567657
2013-07-28    551.411899
2013-07-29    635.588380
                 ...
2014-07-20    584.709917
2014-07-21    599.518663
2014-07-22    625.080000
2014-07-23    637.611449
2014-07-24    588.341455
Length: 364, dtype: float64

In [16]:
# order =1
# items= 1,2,3,4,5

#promedio ingreso por mes
# como no esta la columna mes hay que agregarla

df_promedio['month']= df_promedio['order_date'].astype(str).str[5:7]
df_promedio['month']=df_promedio['month'].astype('int32')
df_promedio.head()

,order_id,order_date,order_customer_id,order_status,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price,month
0,1,2013-07-25,11599,CLOSED,1.0,1.0,957.0,1.0,299.98,299.98,7
1,2,2013-07-25,256,PENDING_PAYMENT,2.0,2.0,1073.0,1.0,199.99,199.99,7
2,2,2013-07-25,256,PENDING_PAYMENT,3.0,2.0,502.0,5.0,250.00,50.00,7
3,2,2013-07-25,256,PENDING_PAYMENT,4.0,2.0,403.0,1.0,129.99,129.99,7
4,3,2013-07-25,12111,COMPLETE,NaN,NaN,NaN,NaN,NaN,NaN,7

In [17]:
df_promedio_final = df_promedio[['month','order_item_subtotal']].groupby('month').sum()['order_item_subtotal']/df_promedio[['month','order_item_order_id']].drop_duplicates().groupby('month').count()['order_item_order_id']
df_promedio_final

month
1     593.916939
2     594.366558
3     598.221987
4     592.235773
5     605.072136
6     612.336000
7     593.416066
8     596.889365
9     602.572335
10    591.392657
11    596.733716
12    595.767676
dtype: float64

In [18]:
df_join = order_df.merge(order_items_df, left_on='order_id',right_on ='order_item_order_id')\
    .merge(products_df, left_on='order_item_product_id',right_on ='product_id')\
    .merge(categories_df, left_on='product_category_id',right_on ='category_id')\
    .merge(departments_df, left_on='category_department_id',right_on ='department_id')
df_join.head()

,order_id,order_date,order_customer_id,order_status,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price,...,product_category_id,product_name,product_description,product_price,product_image,category_id,category_department_id,category_name,department_id,department_name
0,1,2013-07-25,11599,CLOSED,1,1,957,1,299.98,299.98,...,43,Diamondback Women's Serene Classic Comfort Bi,,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop
1,2,2013-07-25,256,PENDING_PAYMENT,2,2,1073,1,199.99,199.99,...,48,Pelican Sunstream 100 Kayak,,199.99,http://images.acmesports.sports/Pelican+Sunstr...,48,7,Water Sports,7,Fan Shop
2,2,2013-07-25,256,PENDING_PAYMENT,3,2,502,5,250.00,50.00,...,24,Nike Men's Dri-FIT Victory Golf Polo,,50.00,http://images.acmesports.sports/Nike+Men%27s+D...,24,5,Women's Apparel,5,Golf
3,2,2013-07-25,256,PENDING_PAYMENT,4,2,403,1,129.99,129.99,...,18,Nike Men's CJ Elite 2 TD Football Cleat,,129.99,http://images.acmesports.sports/Nike+Men%27s+C...,18,4,Men's Footwear,4,Apparel
4,4,2013-07-25,8827,CLOSED,5,4,897,2,49.98,24.99,...,40,Team Golf New England Patriots Putter Grip,,24.99,http://images.acmesports.sports/Team+Golf+New+...,40,6,Accessories,6,Outdoors

In [19]:
df_promedio = df_join[['department_name','order_item_subtotal']].groupby('department_name').sum()
df_promedio.head()

                 order_item_subtotal
department_name
Apparel                   7323700.20
Fan Shop                 17107765.88
Fitness                    280044.14
Footwear                  4006498.77
Golf                      4609028.22

In [20]:
df_promedio = df_join[['department_name','order_item_subtotal']].groupby('department_name').sum()['order_item_subtotal']/df_join[['department_name','order_item_order_id']]\
                    .drop_duplicates().groupby('department_name').count()['order_item_order_id']
print(type(df_promedio))

<class 'pandas.core.series.Series'>